# channels, repeats は v8n の 1/4
backbone:
  - [-1, 1, Conv, 32, 3, 2]            # 0-P1/2
  - [-1, 2, C2f, 32]                   # 1
  - [-1, 1, Conv, 64, 3, 2]            # 2-P2/4
  - [-1, 4, C2f, 64]                   # 3
  - [-1, 1, Conv, 128, 3, 2]           # 4-P3/8
  - [-1, 6, C2f, 128]                  # 5
  - [-1, 1, Conv, 256, 3, 2]           # 6-P4/16
  - [-1, 6, C2f, 256]                  # 7
  - [-1, 1, Conv, 512, 3, 2]           # 8-P5/32
  - [-1, 2, C2f, 512]                  # 9

neck:
  - [[7, 5, 3], 1, FPN, [256,128,64]]  # upsample + concat + C2f
  - [[5, 3, 1], 1, PAN, [128,64,32]]   # downsample path

head:
  - [-1, 1, Detect, [1]]               # 1 class
